---
kind: type
id: T:Autodesk.Revit.DB.Events.ProgressChangedEventArgs
source: html/11e76066-82f3-21c7-6c1f-dfbbf0a1abd9.htm
---
# Autodesk.Revit.DB.Events.ProgressChangedEventArgs

The event arguments used by the ProgressChanged event.

## Syntax (C#)
```csharp
public class ProgressChangedEventArgs : RevitAPISingleEventArgs
```